; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image9 - mode
	infrared5 - mode
	infrared3 - mode
	infrared1 - mode
	image4 - mode
	image7 - mode
	infrared8 - mode
	image2 - mode
	image0 - mode
	thermograph6 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image9)
	(supports instrument0 thermograph6)
	(supports instrument0 image0)
	(supports instrument0 image2)
	(supports instrument0 infrared8)
	(supports instrument0 image7)
	(supports instrument0 image4)
	(supports instrument0 infrared1)
	(supports instrument0 infrared3)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Phenomenon6 infrared5)
	(have_image Phenomenon6 infrared3)
	(have_image Star7 image7)
	(have_image Star8 image0)
	(have_image Planet9 image4)
	(have_image Planet10 image0)
	(have_image Phenomenon11 thermograph6)
	(have_image Planet12 infrared8)
	(have_image Planet12 image4)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
2. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 9
3. (turn_to satellite0 planet10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet10)
   goals met: 0 of 9
4. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 1 of 9
5. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 9
6. (take_image satellite0 phenomenon6 instrument0 infrared5)
   added: (have_image phenomenon6 infrared5)
   goals met: 2 of 9
7. (take_image satellite0 phenomenon6 instrument0 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 3 of 9
8. (turn_to satellite0 phenomenon11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 9
9. (take_image satellite0 phenomenon11 instrument0 thermograph6)
   added: (have_image phenomenon11 thermograph6)
   goals met: 4 of 9
10. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 4 of 9
11. (take_image satellite0 planet12 instrument0 image4)
   added: (have_image planet12 image4)
   goals met: 5 of 9
12. (take_image satellite0 planet12 instrument0 infrared8)
   added: (have_image planet12 infrared8)
   goals met: 6 of 9
13. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 6 of 9
14. (take_image satellite0 planet9 instrument0 image4)
   added: (have_image planet9 image4)
   goals met: 7 of 9
15. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 7 of 9
16. (take_image satellite0 star7 instrument0 image7)
   added: (have_image star7 image7)
   goals met: 8 of 9
17. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 8 of 9
18. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 9 of 9
